Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML22_DFP/3.2.39/atdf/ATSAML22G18A.atdf
        <register modes="I2CS" name="SYNCBUSY" offset="0x1C" rw="R" size="4" initval="0x00000000" caption="I2CS Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="SERCOM Enable Synchronization Busy" mask="0x2"/>
        </register>
        <register modes="SPIM" name="SYNCBUSY" offset="0x1C" rw="R" size="4" initval="0x00000000" caption="SPIM Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="SERCOM Enable Synchronization Busy" mask="0x2"/>
          <bitfield name="CTRLB" caption="CTRLB Synchronization Busy" mask="0x4"/>
        </register>
        <register modes="SPIS" name="SYNCBUSY" offset="0x1C" rw="R" size="4" initval="0x00000000" caption="SPIS Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="SERCOM Enable Synchronization Busy" mask="0x2"/>
          <bitfield name="CTRLB" caption="CTRLB Synchronization Busy" mask="0x4"/>
        </register>
        <register modes="USART_EXT" name="SYNCBUSY" offset="0x1C" rw="R" size="4" initval="0x00000000" caption="USART_EXT Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="SERCOM Enable Synchronization Busy" mask="0x2"/>
          <bitfield name="CTRLB" caption="CTRLB Synchronization Busy" mask="0x4"/>
          <bitfield name="RXERRCNT" caption="RXERRCNT Synchronization Busy" mask="0x8"/>
        </register>
        <register modes="USART_INT" name="SYNCBUSY" offset="0x1C" rw="R" size="4" initval="0x00000000" caption="USART_INT Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="SERCOM Enable Synchronization Busy" mask="0x2"/>
          <bitfield name="CTRLB" caption="CTRLB Synchronization Busy" mask="0x4"/>
          <bitfield name="RXERRCNT" caption="RXERRCNT Synchronization Busy" mask="0x8"/>
        </register>
        <register modes="USART_EXT" name="RXERRCNT" offset="0x20" rw="R" size="1" initval="0x00" caption="USART_EXT Receive Error Count">
          <bitfield name="RXERRCNT" caption="Receive Error Count" mask="0xFF"/>
        </register>
        <register modes="USART_INT" name="RXERRCNT" offset="0x20" rw="R" size="1" initval="0x00" caption="USART_INT Receive Error Count">
          <bitfield name="RXERRCNT" caption="Receive Error Count" mask="0xFF"/>
        </register>
        <register modes="I2CM" name="ADDR" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="I2CM Address">
          <bitfield name="ADDR" caption="Address Value" mask="0x7FF"/>
          <bitfield name="LENEN" caption="Length Enable" mask="0x2000"/>
          <bitfield name="HS" caption="High Speed Mode" mask="0x4000"/>
          <bitfield name="TENBITEN" caption="Ten Bit Addressing Enable" mask="0x8000"/>
          <bitfield name="LEN" caption="Length" mask="0xFF0000"/>
        </register>
        <register modes="I2CS" name="ADDR" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="I2CS Address">
          <bitfield name="GENCEN" caption="General Call Address Enable" mask="0x1"/>
          <bitfield name="ADDR" caption="Address Value" mask="0x7FE"/>
          <bitfield name="TENBITEN" caption="Ten Bit Addressing Enable" mask="0x8000"/>
          <bitfield name="ADDRMASK" caption="Address Mask" mask="0x7FE0000"/>
        </register>
        <register modes="SPIM" name="ADDR" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="SPIM Address">
          <bitfield name="ADDR" caption="Address Value" mask="0xFF"/>
          <bitfield name="ADDRMASK" caption="Address Mask" mask="0xFF0000"/>
        </register>
        <register modes="SPIS" name="ADDR" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="SPIS Address">
          <bitfield name="ADDR" caption="Address Value" mask="0xFF"/>
          <bitfield name="ADDRMASK" caption="Address Mask" mask="0xFF0000"/>
        </register>
        <register modes="I2CM" name="DATA" offset="0x28" rw="RW" size="1" initval="0x00" caption="I2CM Data">
          <bitfield name="DATA" caption="Data Value" mask="0xFF"/>
        </register>
        <register modes="I2CS" name="DATA" offset="0x28" rw="RW" size="1" initval="0x00" caption="I2CS Data">
          <bitfield name="DATA" caption="Data Value" mask="0xFF"/>
        </register>
        <register modes="SPIM" name="DATA" offset="0x28" rw="RW" size="4" initval="0x00000000" caption="SPIM Data">
          <bitfield name="DATA" caption="Data Value" mask="0x1FF"/>
        </register>
        <register modes="SPIS" name="DATA" offset="0x28" rw="RW" size="4" initval="0x00000000" caption="SPIS Data">
          <bitfield name="DATA" caption="Data Value" mask="0x1FF"/>
        </register>
        <register modes="USART_EXT" name="DATA" offset="0x28" rw="RW" size="2" initval="0x0000" caption="USART_EXT Data">
          <bitfield name="DATA" caption="Data Value" mask="0x1FF"/>
        </register>
        <register modes="USART_INT" name="DATA" offset="0x28" rw="RW" size="2" initval="0x0000" caption="USART_INT Data">
          <bitfield name="DATA" caption="Data Value" mask="0x1FF"/>
        </register>
        <register modes="I2CM" name="DBGCTRL" offset="0x30" rw="RW" size="1" initval="0x00" caption="I2CM Debug Control">
          <bitfield name="DBGSTOP" caption="Debug Mode" mask="0x1"/>
        </register>
        <register modes="SPIM" name="DBGCTRL" offset="0x30" rw="RW" size="1" initval="0x00" caption="SPIM Debug Control">
          <bitfield name="DBGSTOP" caption="Debug Mode" mask="0x1"/>
        </register>
        <register modes="SPIS" name="DBGCTRL" offset="0x30" rw="RW" size="1" initval="0x00" caption="SPIS Debug Control">
          <bitfield name="DBGSTOP" caption="Debug Mode" mask="0x1"/>
        </register>
